Repository: PandaWhoCodes/INGEnious_python_tasks
Catalog: $common/student/$i18n/*.po
Languages: fr

source: [LSINF1101-PYTHON] Introduction to programming
fr: [LSINF1101-PYTHON] Introduction à la programmation

source: The method ``average(list)`` returns the arithmetic mean of the elements contained in list, except if ``list`` is empty in which case it should return ``False``.
fr: La méthode ``average(list)`` renvoie la moyenne arithmétique des éléments contenus dans list, sauf si ``list`` est vide auquel cas elle devra retourner ``False``.

source: Session 5: Average
fr: Session 5: Moyenne

source: Implementation
fr: Implémentation

source: Provide the body of the following method: .. code-block:: python def average(list):
fr: Fournissez le corps de la méthode suivante: .. code-block:: python def average(list):

source: The average of {} is {} and you returned {}.
fr: La moyenne de {} est {} et vous avez retourné {}.

source: When the list is empty you should return {}.
fr: Lorsque la liste est vide, vous devez retourner {}.

source: The method ``count_diff(lst)`` returns the number of different elements contained in the list lst. *For example:* - If ``lst`` equals ``[3, 5, 3]`` then the method should return 2. - If all the elements are the same, if should return 1. - If the list ``lst`` is empty, it should return 0.
fr: La méthode `` count_diff (lst) `` renvoie le nombre d'éléments différents contenus dans la liste lst. Par exemple: - Si `` lst`` est égal à `` [3, 5, 3] `` alors la méthode devrait retourner 2. - Si tous les éléments sont identiques, elle devrait retourner 1. - Si la liste ` `lst`` est vide, elle devrait retourner 0.

source: Session 5: Difference counter
fr: Session 5: Compteur de différences

source: Provide the body of the following method: .. code-block:: python def diff_count(lst):
fr: Fournissez le corps de la méthode suivante: .. code-block :: python def diff_count (lst):

source: The number of different elements of {} is {} and you returned {}.
fr: Le nombre d'éléments différents de {} est {} et vous avez renvoyé {}.

source: Write a program allowing to play the game `fizzbuzz <https://en.wikipedia.org/wiki/Fizz_buzz>`_. You receive a number (stored in variable ``i``). We will implemente a simplified version of the game. For the integer ``i``, the game will : - Store the string "``fizz``" in the variable ``temp`` if the number is divisible by 3. - Store the string "``buzz``" in the variable ``temp`` if the number is divisible by 5. - Store the string "``fizzbuzz``" in the variable ``temp`` if the number is divisible by 3 and by 5. - Store the string "``no``" in the variable ``temp`` if the number is not divisible by 3 nor by 5. .. code-block:: python i = # number to check (i >= 1) temp = "" # fizz, buzz, fizzbuzz, no
fr: Ecrivez un programme permettant de jouer au jeu `fizzbuzz <https://fr.wikipedia.org/wiki/Fizz_buzz>`_. Vous recevez un nombre (stocké dans la variable ``i``). Nous allons implémenter une version simplifiée du jeu. Pour l'entier ``i``, le jeu va : - Stocker le string "``fizz``" dans la variable ``temp`` si le nombre est divisible par 3. - Stocker le string "``buzz``" dans la variable ``temp`` si le nombre est divisible par 5. - Stocker le string "``fizzbuzz``" dans la variable ``temp`` si le nombre est divisible par 3 et par 5. - Stocker le string "``no``" dans la variable ``temp`` si le nombre n'est divisible ni par 3 ni par 5. .. code-block:: python i = # number to check (i >= 1) temp = "" # fizz, buzz, fizzbuzz, no

source: Mission 2: FizzBuzz
fr: Session 2: FizzBuzz

source: ``i`` is provided and you need to store the adequate return value in ``temp``
fr: ``i``est fourni et vous devez stocker la valeur de retour appropriée dans ``temp``

source: With {} as input the program should return {} and you returned {}.
fr: Avec {} comme entrée, le programme doit retourner {} et vous avez retourné {}.

source: The Greatest Common Divisor of two natural numbers ``a`` and ``b`` is the biggest natural number ``k`` such that the division of ``a`` and ``b`` by this natural ``k`` is an entire division. Euclid found a very simple recursive algorithm to find the GCD of two numbers: $$\\text{gcd}(a,0) = a$$ $$\\text{gcd}(a,b) = \\text{gcd}(b,a\\%b)$$ Recall that the operator ``%`` returns the remainder of the euclidian division.
fr: Le plus grand commun diviseur de deux nombres naturels '' a'' et '' b'' est le plus grand nombre naturel '' k'' telle que la division de '' a'' et '' b'' par ce naturel '' k'' est une division entière. Euclide a trouvé un algorithme récursif très simple afin de trouver le PGCD de deux nombres : $$\\text{gcd}(a,0) = a $$ \\text{gcd}(a,b) $$ = \\text{gcd}(b,a\\%b)$ $ Souvenez-vous que l’opérateur '' %'' renvoie le reste de la division euclidienne.

source: Session 3: Greatest common divisor
fr: Session 3: Plus grand commun diviseur

source: Implement the function ``gcd(a,b)`` in Python.
fr: Implémentez la fonction ``gcd(a,b)`` en Python.

source: You did not name the method as expected.
fr: Vous n'avez pas nommé la méthode comme demandé.

source: Test zero - The greatest common divisor between {} and {} is {} and you returned {}.
fr: Test zéro - Le plus grand diviseur commun entre {} et {} est {} et vous avez renvoyé {}.

source: The greatest common divisor between {} and {} is {} and you returned {}.
fr: Le plus grand diviseur commun entre {} et {} est {} et vous avez renvoyé {}.

source: The Greatest Divisor of a number ``a`` is the biggest number ( except ``a`` itself) such that the division of ``a`` by this natural is an entire division. Since \\(0\\) is divisible by any natural this may cause some problems if you will look for the bigger one, so we expect you to return ``False``. Recall that the operator ``%`` returns the remainder of the Euclidian division.
fr: Le plus grand diviseur d'un nombre ``a`` est le plus grand nombre ( à part ``a`` lui-même) tel que la division de ``a`` par ce nombre est une division entière. Puisque \\(0\\) est divisible par n'importe quel naturel, cela pourrait créer des problèmes si vous cherchez le plus grand possible, nous nous attendons donc à ce que vous renvoyez ``False``. Souvenez-vous que l'opérateur ``%`` renvoi le reste de la division Euclidienne.

source: Session 3: Greatest divisor
fr: Session 3: Plus grand diviseur

source: Provide the body of the following method: .. code-block:: python def greatest_divisor(a):
fr: Fournissez le corps de la méthode suivante: .. code-block:: python def greatest_divisor(a):

source: The greatest divisor of {} is {} and you returned {}.
fr: Le plus grand diviseur de {} est {} et vous avez renvoyé {}.

source: The expected answer for the greatest divisor of {} is {} and you returned {}.
fr: La réponse attendue pour le plus grand diviseur de {} est {} et vous avez renvoyé {}.

source: Suppose you now have ``base`` € on your savings account. If you leave it ``x`` years on that account at a fixed cummulative interest rate of ``y`` %, what will be the balance on your account after these ``x`` years? Return that amount.
fr: Supposez que vous avez actuellement ``base`` € sur votre compte épargne. Si vous l'y laissez ``x`` années sur ce compte à un taux d'intérêts fixe de ``y`` %, quel sera le montant sur ce compte après ces ``x`` années? Retournez ce montant.

source: Session 3: Interest calculation
fr: Session 3: Calcul d'intérêts

source: Provide the body of the following method: .. code-block:: python def interests(base, y, x):
fr: Fournissez le corps de la méthode suivante: .. code-block:: python def interests(base, y, x):

source: When calling interests(base, y, x) with base = {}€ , y = {}% and x = {} years you returned {} but the expected value was {}.
fr: Quand vous appelez interests(base, y, x) avec base = {}€ , y = {}% and x = {} années vous renvoyé {} mais la valeur attendue était {}.

source: Suppose the variables ``a``, ``b`` and ``x`` contain a natural number. Write a code fragment that would assign the boolean value ``True`` to the variable named ``interval`` if ``x`` belongs to ``[a, b]``. Assign it the value ``False`` otherwise.
fr: En supposant que les variables ``a``, ``b`` et ``x`` contiennent un nombre naturel. Ecrivez un fragment de code qui va stocker la valeur booléenne ``True`` dans la variable nommée ``interval`` si ``x`` appartient à ``[a, b]``. Assignez-y la valeur ``False`` sinon.

source: Session 2: Interval
fr: Session 2: Intervalle

source: .. code-block:: python a = ... #lower bound of the interval b = ... #upper bound of the interval x = ... #variable to evaluate interval = ... #store in this variable the belonging of x in the interval
fr: .. code-block:: python a = ... #borne inférieure de l'intervalle b = ... # borne supérieure de l'intervalle x = ... #variable à évaluer interval = ... #stockez dans cette variable l'appartenance de x à l'intervalle

source: The belonging of {} to [{}, {}] is {} and you returned {}.
fr: L'appartenance de {} à [{}, {}] est {} et vous avez retourné {}.

source: The method ``maximum(lst)`` returns the maximum of the elements contained in the list ``lst``. The value ``False`` is returned if the list ``lst`` is empty.
fr: La méthode ``maximum(lst)`` renvoit le maximum des éléments contenus dans la liste ``lst``. La valeur ``False`` est renvoyée si la liste``lst`` est vide.

source: Implement the function ``maximum(lst)`` in Python.
fr: Implémentez la fonction ``maximum(lst)`` en Python.

source: The maximum of {} is {} and you returned {}.
fr: Le maximum de {} est {} et vous avez renvoyé {}.

source: Suppose the variables ``a``, ``b`` and ``c`` contain a natural number. Write a code fragment that assigns to the variable ``median`` the median value of these numbers. As a reminder, the median of three values is the value such that there is exactly one value lower than (or equal to) it and one value higher than (or equal to) it.
fr: En supposant que les variables ``a``, ``b`` et ``c`` contiennent un nombre naturel. Ecrivez un fragment de code qui assigne à la variable ``median`` la valeur médiane de ces nombres. Petit rappel: la médiane de 3 valeurs est la valeur tel qu'il y a une valeur plus grande (ou égale) et une valeur plus petite (ou égale) à celle-ci.

source: Session 2: Median
fr: Session 2: Médiane

source: .. code-block:: python a = ... #variable to evaluate b = ... #variable to evaluate c = ... #variable to evaluate median = ... #store in this variable the median of the three variables
fr: .. code-block:: python a = ... #variable à évaluer b = ... #variable à évaluer c = ... #variable à évaluer median = ... #stockez dans cette variable la médiane de ces trois variables

source: The median of {} is {} and you returned {}.
fr: La médiane de {} est {} et vous avez renvoyé {}.

source: Suppose the variables ``a``, ``b`` and ``c`` contain a natural number. Write a code fragment that assigns to the variable ``min`` the smallest of these numbers.
fr: En supposant que les variables ``a``, ``b`` et ``c`` contiennent un nombre naturel. Ecrivez un fragment de code qui assigne à la variable ``min`` le plus petit de ces nombres.

source: .. code-block:: python a = ... #variable to evaluate b = ... #variable to evaluate c = ... #variable to evaluate min = ... #store in this variable the smallest of the three variables
fr: .. code-block:: python a = ... #variable à évaluer b = ... #variable à évaluer c = ... #variable à évaluer min = ... #stockez dans cette variable la plus petite de ces 3 variables

source: The minimum of {} is {} and you returned {}.
fr: Le minimum de {} est {} et vous avez renvoyé {}.

source: `The prime numbers <https://en.wikipedia.org/wiki/Prime_number>`_ , used by mathematicians, are a set of numbers sharing a same property. A prime is a natural number greater than 1 that has no positive divisors other than 1 and itself. A natural number greater than 1 that is not a prime number is called a composite number. To calculate prime numbers you can use the principle of Eratosthene's sieve: for each successive number, check if it is divisible by the lower prime numbers already found. If it is not divisible by any, it is prime and can be added to the list. Implement the function primes(max) that returns the list of all prime numbers until max. If max is negative or zero, the empty list should be returned. To limit the complexity of your solution, decompose into auxiliary functions as needed.
fr: `Les nombres premiers <https://fr.wikipedia.org/wiki/Nombre_premier>`_ , utilisés par les mathématiciens, sont un ensemble de nombres partageant une même propriété. Un nombre premier est un naturel plus grand que 1 qui n'a pas d'autre diviseur positif que 1 et lui-même. Un nombre naturel plus grand que 1 qui n'est pas un nombre premier est appelé un nombre composé. Pour calculer des nombres premiers, vous pouvez utilisez le principe du crible d'Eratosthène: pour chaque nombre successif, vérifiez s'il est divisible par les nombres premiers déjà trouvés. Si ce n'est pas le cas, c'est un nombre premier et il peut être ajouté à la liste. Implémentez la fonction primes(max) qui renvoi la liste de tous les nombres premiers jusqu'à max. Si max est négatif ou zéro, une liste vide devrait être renvoyé. Pour limiter la complexité de votre solution, décomposez la résolution du problème en autant de fonction auxiliaires que nécessaires.

source: Session 5: Prime numbers
fr: Session 5: Nombres premiers

source: Implement the function ``primes(max)`` in Python.
fr: Implémentez la fonction ``primes(max)`` en Python.

source: The prime numbers with a maximum value of {} is {} and you returned {}.
fr: La liste des nombres premiers pour une valeur maximale {} est {} et vous avez renvoyé {}.

source: The prime numbers with a maximum value of {} is {} and you returned {}. You should check the conditions to be a prime number.
fr: La liste des nombres premiers pour une valeur maximale {} est {} et vous avez renvoyé {}. Vous devriez vérifier les conditions pour qu'un nombre puisse être premier.

source: Your program does not compile:
fr: Votre programme ne compile pas:

source: The program does not compile for external reasons,please contact an administrator asap:
fr: Le programme ne compile pas pour des raisons externes, veuillez contacter un administrateur au plus vite:

source: The memory limit of your program is exceeded
fr: La limite de mémoire de votre programme est dépassée

source: The time limit of your program is exceeded
fr: La limite de temps d'exécution de votre programme est dépassée

source: It seems that you have made mistakes in your code…
fr: Il semble que vous ayiez fait des erreurs dans votre code…

source: You asnwered well this question
fr: Vous avez bien répondu à cette question

source: The `Body mass index (BMI) <https://en.wikipedia.org/wiki/Body_mass_index>`_ or Quetelet index, used by dieticians, is indicative of the condition of a person. A normal person should have an index between 20 and 25. Below 20, she is considered thin, above 25 overweight. Beyond 30, the person is obese! This index is calculated as the ratio between a person's weight, expressed in kg, and the square of the person's height, expressed in meters. Create a function ``quetelet(height, weight)`` to calculate a person's Quetelet index and return ``thin`` string for a person with an index strictly less than 20, ``normal`` for a person whose index is between 20 and 25, ``overweight`` if the index is strictly greater than 25 and less than or equal to 30 and ``obese`` when it is strictly greater than 30.
fr: L'`indice de masse corporel (BMI) <https://fr.wikipedia.org/wiki/Indice_de_masse_corporelle>`_ ou indice de Quetelet, utilisés par les diététiciens, est une indication de la condition d'une personne. Une personne normale devrait avoir un indice entre 20 et 25. En dessous de 20, elle est considérée maigre, au dessus de 25 en surpoids. Au delà de 30, la personne est obèse! Cet indice est calculé comme le ratio du poids d'une personne (exprimé en kg) et le carré de la taille d'une personne (exprimée en mètres). Créer une fonction ``quetelet(height, weight)`` pour calculer l'indice de Quetelet d'une personne et retournez le string ``thin`` pour une personne avec un index strictement plus petit que 20, ``normal`` pour une personne dont l'index est entre 20 et 25, ``overweight`` si l'index est strictement plus grand que 25 et plus petit ou égal à 30 et ``obese`` quand il est strictement plus grand que 30.

source: Session 3: BMI index
fr: Session 3: Indice BMI

source: Implement the function ``quetelet(height, weight)`` in Python.
fr: Implémentez la fonction ``quetelet(height, weight)`` en Python.

source: The quetelet index with a height of {} and a weight of {} is {} and you returned {}. You should watch the bounds of your conditions.
fr: L'indice de Quetelet avec une taille de {} et un poids de {} est {} et vous renvoyé {}. Vous devriez vérifier les limites de vos conditions.

source: The quetelet index with a height of {} and a weight of {} is {} and you returned {}.
fr: L'indice de Quetelet avec une taille de {} et un poids de {} est {} et vous renvoyé {}.

source: Suppose the variables ``a`` and ``b`` contain a natural number. Write a code fragment that assigns the remainder of their division in the variable ``rest``. To implement your solution, use only a ``while`` loop and subtractions (the simple solution rest = a % b is not allowed; we want to test if you are capable of implementing such an operation yourself). Note that you should not allow division by 0 and assign the value ``False`` to ``rest`` if this would occur.
fr: En supposant que les variables ``a`` et ``b`` contiennent un nombre naturel. Ecrivez un fragment de code qui assigne le reste de leur division à la variable ``rest``. pour implémenter votre solution, utilisez seulement une boucle ``while`` et des soustractions (la simple solution: rest = a % b n'est pas autorisée; nous voulons tester si vous êtes capable d'implémenter une telle opération vous-même). Prêtez attention au fait que vous ne devriez pas autoriser la division par 0 et assignez la valeur ``False`` à ``rest`` si le cas se produit.

source: Session 2: Remainder of an integer division
fr: Session 2: Reste d'une division entière

source: .. code-block:: python a = ... #variable to evaluate b = ... #variable to evaluate rest = ... #store in this variable the remainder of the division a/b
fr: .. code-block:: python a = ... #variable à évaluer b = ... #variable à évaluer rest = ... #stockez dans cette variable le reste de la division a/b

source: The remainder of the entire division {} / {} is {} and you returned {}.
fr: Le reste de la division entière {} / {} est {} et vous avez renvoyé {}.

source: Variables assignment
fr: Assignement de variables

source: Pick the piece of code which will print 42.
fr: Choisissez le morceau de code qui va printer 42.

source: In Python space in variable's name is not supported. You can compensate with: -CamelCasing: myVar -Underscores: my_var (prefered by Python naming conventions)
fr: En Python les espaces dans les noms de variables ne sont pas supportés. Vous pouvez compensez avec: -CamelCasing: myVar -Underscores: my_var (préféré parles conventions de nommage de Python)

source: You should pay attention to the name of your variable since Python is case sensible.
fr: Vous devriez prêter attention au nom de votre variable puisque Python est sensible à la casse.

source: While loops
fr: Boucles while

source: Which of the following code fragments calculates the sum of the first ``n`` positive integers?
fr: Lequel des fragments de code suivants calcule la somme des ``n`` premiers entiers positifs?

source: The correct answer is not attained. Did you not forget an iteration?
fr: La bonne réponse n'est pas atteinte. N'avez-vous pas oublié une itération?

source: Your loop will never end. Check your condition.
fr: Votre boucle ne finira jamais. Surveillez votre condition.

source: The indentation is an extremelly important part of coding in Python since it allows to know in which block the statement is executed. Are ``i`` and ``sum`` supposed to be assigned in a block before the loop?
fr: L'indentation est un élément très important du codage en python puisque cela permet de savoir dans quel bloc une instruction s'exécute. ``i`` et ``sum`` sont-ils supposés être assignés dans le bloc avant la boucle?

source: ``While`` loops are useful when we need to repear similar tasks multiple times. In arithmetic, the factorial of a positive integer (``n``) and greater than `1` is defined as the product of all integers less than or equal to ``n``. The factorial of ``n`` is :math:`n!`. Thus :math:`4! = 24`. Among the ``while`` loops below, which calculates correctly :math:`n!` ?
fr: Les boucles ``while`` sont utiles quand on a besoin de répéter une tâche similaires plusieurs fois. En arithmétique, la factorielle d'un entier positif (``n``) plus grand que `1` est définie comme le produit de tous les entiers plus petits ou égaux à ``n``. La factorielle de ``n`` est :math:`n!`. Et donc :math:`4! = 24`. Au sein des boucles ``while`` ci-dessous, laquelle calcule correctement :math:`n!` ?

source: Will your loop stop in other case than `1`?
fr: Votre boucle va-t-elle s'arrêter dans d'autres cas que `1`?

source: Pretty sure you calculated the factorial of `n-1` .
fr: Assez-sûre que vous venez de calculer la factoriel de `n-1` .

source: Python syntax
fr: Syntaxe de Python

source: Which of the following program fragments do respect the syntax of the language?
fr: Lesquels de ces fragments de code suivants respectent la syntaxe du langage?

source: The indentation is an extremelly important part of coding in Python since it allows to know in which block the statement is executed. In this case your program will meet an unexpected indentation.
fr: L'indentation est un élément important du codage en python puisqu'il permet de savoir dans quel bloc une instruction est exécutée. Dans ce cas le programme va trouver un indentation inattendue.

source: Since there is no type in Python a variable can contain as well an integer as text. test would be print with this code fragment.
fr: Puisqu'il n'y a pas de types en Python, une variable peut contenir aussi bien un integer que du texte test sera imprimé avec ce fragment de code.

source: Comments in Python
fr: Commentaires en Python

source: Check the snippets which contain a valid comment.
fr: Validez la case contenant le bon commentaire.

source: The comment is enclosed in a string.
fr: Le commentaire est inclus dans un string.

source: It is correct BUT don't use triple-quotes; this is for documentation strings not block comments, although it has a similar effect it is best practice to use ``#``
fr: Cette réponse est correcte MAIS n'utilisez pas de triple guillemets; c'est réservé pour des strings de documentation et non des blocs de commentaires. Même si cela a le même effet, c'est une meilleur pratique d'utiliser ``#``

source: Python naming conventions
fr: Conventions de nommage Python

source: Which of the following statements are respecting the Python naming conventions?
fr: Lesquelles des instructions suivantes respectent les conventions de nommage Python?

source: Snake case is usually prefered regarding variables names. Although lower camel case is allowed for functions names in Python (where that's already the prevailing style).
fr: Snake case est en général ce qui est préféré en ce qui concerne les noms de variables. Cependant lower camel case est autorisé pour les noms de fonctions en Python (quand c'est déjà le style qui prévaut).

source: Snake case is usually prefered regarding variables names. Although screaming snake case is used for constant in Python.
fr: Snake case est généralement préféré en ce qui concerne les noms de variables. Cependant screaming snake case est utilisé pour les constantes en Python.
