Repository: PandaWhoCodes/INGEnious_python_tasks
Catalog: $common/student/$i18n/*.po
Languages: fr

source: Snake case is usually prefered regarding variables names. Although upper camel case is used for class names in Python.
fr: Snake case est généralement préféré en ce qui concerne les noms de variables. Cependant upper camel case est utilisé pour les noms des classes en Python.

source: Exchange variables values
fr: Echange de valeurs de variables

source: It is often useful to be able to exchange values between variables. Considerate the following variables: .. code-block:: python a = 42 b = 41 Which of following fragments of code exchange the values correctly?
fr: Il est souvent pratique de pouvoir échanger les valeurs entre 2 variables. Considérez les variables suivantes: .. code-block:: python a = 42 b = 41 Lequel des fragments de code suivants échange les valeurs correctement?

source: By doing it this way you will lose the value contained in ``b`` and the value of ``a`` will be stored in the 2 variables.
fr: En le faisant de cette façon, vous allez perdre la valeur contenue dans ``b`` et la valeur de ``a`` sera stockée dans 2 variables.

source: This would work but it is more efficient and clear to do it with this little trick: .. code-block:: python a,b = b,a
fr: Ce code fonctionnerait mais il est plus efficace et claire de le faire avec cette petite astuce: .. code-block:: python a,b = b,a

source: Calculate min
fr: Calcul du minimum

source: Consider a program that manipulates two variables: ``a`` and ``b`` . Among the code fragments below, which correctly places in the variable ``min`` the minimum between the contents of ``a`` and ``b`` ?
fr: En considérant un programme qui manipule deux variables: ``a`` et ``b`` . Parmi les fragments de code ci-dessous, lequel place correctement dans la variable ``min`` le minimum des contenus de ``a`` et ``b`` ?

source: The maximum is stored in min instead of the minimum with this code.
fr: Le maximum est stocké dans min au lieu de minimum dans ce code.

source: The indentation is an extremelly important part of coding in Python since it allows to know in which block the statement is executed. What is executed in this case if the condition is verified?
fr: L'indentation est un élément extrêmement important du codage en Python puisque cela permet de savoir dans quel bloc une instruction doit s'exécuter. Qu'est-ce-qui s'exécutera dans ce cas-ci si la condition se vérifie?

source: Absolute value
fr: Valeur absolue

source: Which of these code fragments places in the ``abs`` variable the absolute value of ``x`` ?
fr: Lequel de ces fragments de code place dans la variable ``abs`` la valeur absolue de ``x`` ?

source: What happens if ``x`` is a positive integer?
fr: Que se passe-t-il si ``x`` est un entier positif?

source: You should consider carefully the condition used to store `-x` in ``abs`` .
fr: Vous devriez revérifier la condition pour stocker `-x` dans ``abs`` .

source: Intervals
fr: Intervalles

source: In mathematics, we define intervals, closed, open and semi-open. The semi-open interval :math:`[3,7[` includes all real numbers that are greater than or equal to `3` and strictly less than 7. Which of the following code fragments display ``true`` on its standard output if and only if ``x`` belongs to the interval :math:`[a, b[` ? We assume for this question that the value stored in the variable ``a`` is strictly less than that stored in the ``b`` variable.
fr: En mathématique, nous définissons des intervalles, clos, ouverts et semi-ouverts. L'intervalle semi-ouvert :math:`[3,7[` inclus tous les nombres réels plus grand ou égaux à `3` et strictement plus petit que 7. Lesquels des fragments de code suivants affichent ``true`` sur la sortie standard si et seulement si ``x`` appartient à l'intervalle :math:`[a, b[` ? Nous supposons pour cette question que la valeur stockée dans la variable ``a`` est strictement plus petite ou égale à celle stockée dans la variable ``b``.

source: Is there any way for ``x`` to be between ``a`` and ``b`` with this condition?
fr: Y a-t-il un moyen pour ``x`` d'être entre ``a`` et ``b`` avec cette condition?

source: What happens if ``x == a`` ?
fr: Que se passe-t-il si ``x == a`` ?

source: Operators usages
fr: Utilisation des opérateurs

source: Which of the following code fragments prints 14?
fr: Lequel de ces fragments de code imprimera 14?

source: The result of the division is 14.333333334
fr: Le résultat de la division est 14.333333334

source: You cannot concatenate a string and an int.
fr: La concaténation d'un string et d'un int n'est pas possible.

source: In computer science, a sorting algorithm is an algorithm that puts the elements of a list in a certain order. The most-used orders are numerical order and lexicographical order. Efficient sorting is important for optimizing the use of other algorithms (such as search and merge algorithms) which require input data to be in sorted lists; it is also often useful for canonicalizing data and for producing human-readable output. More formally, the output must satisfy two conditions: * The output is in nondecreasing order (each element is no smaller than the previous element according to the desired total order); * The output is a permutation (reordering but with all of the original elements) of the input.
fr: En sciences informatiques, un algorithme de tri est un algorithme qui met les éléments d'une liste dans un certains ordre. Les plus utilisés sont les ordres numériques et lexicaux. Un tri efficace est important pour optimiser l'utilisation d'autres algorithmes (tels que les algorithmes de recherches et de fusions) qui ont besoin que les données reçues soient triées; c'est également utilisé dans la canonisation de données ou la production de données lisibles par l'humain. Plus formellement, la sortie doit satisfaire à deux conditions: * Le résultat est en ordre non décroissant (chaque élément n'est pas plus petit que l'élément précédent en accord avec l'ordre désiré) * Le résultat est une permutation (réarrangement des éléments originaux) de ce qui est donné en entrée.

source: Session 5: List sorting
fr: Session5: Tri de liste

source: .. code-block:: python a_list = ... #list to sort sorted_list = ... #store in this variable the sorted version of the list
fr: .. code-block:: python a_list = ... #liste à trier sorted_list = ... #stockez dans cette variable la version triée de la liste

source: Nice try! But 'sort' has been disabled for list objects. Please enter an actual algorithm sorting the list.
fr: Bien essayé! Mais 'sort' a été désactivé pour les objets de type liste. Merci d'entre un algorithme qui triera la listet.

source: The sorted version of {} is {} and you returned {}.
fr: La version triée de {} est {} et vous avez retourné {}.

source: Nice try! But 'sorted' has been disabled for list objects. Please write an actual algorithm sorting the list.
fr: Bien essayé! Mais 'sorted' a été désactivé pour les objets de type liste. Merci d'écrire un algorithme triant réellement la liste.
